Revit 2024 API
StairsPathType.StairsPathDirection Property
 The style of the stairs path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public StairsPathDirection StairsPathDirection { get; }
Visual Basic
Public ReadOnly Property StairsPathDirection As StairsPathDirection
	Get
Visual C++
public:
property StairsPathDirection StairsPathDirection {
	StairsPathDirection get ();
}
See Also
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace